class AboutZikrModel {
  final String description;
  AboutZikrModel({
    required this.description,
  });
}

final List<AboutZikrModel> aboutZikr = [
  AboutZikrModel(
      description:
          'Абу Хурейра и Абу Саид передали, что Пророк (мир ему и благословение) сказал: "Какие бы люди не упомянули Аллаха, их окружат ангелы и покроет их милость Аллаха, и снизойдет на них сакина (спокойствие духа), и упомянет их Аллах среди тех, кто возле Него'),
  AboutZikrModel(
      description:
          'Утренние и вечерние дуа и зикры (минимум, который нужно выучить наизусть) 1. «Аллахумма, Анта Робби, ля иляха илля Анта, халяқтани уа ана абдукя, уа ана ‘аля ахдикя уа уахдикя мастата ту. Аузу бикя мин шарри ма санату, абуу лякя бини матикя аляйя, уа абу у бизанби, фағфир ли, фаиннаху ля йағфиру аз-зунуба илля Анта»  اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ «О Аллах, Ты − Господь мой, и нет божества достойного поклонения, кроме Тебя. Ты создал меня, и я − Твой раб, и я придерживаюсь завета данного Тебе и придерживаюсь обещания Твоего как могу. Я прибегаю к Твоей защите от зла того, что я сделал. Я признаю милость Твою, которой Ты меня наделил, и признаю грех свой, так прости же меня, ибо, поистине, никто не прощает грехов, кроме Тебя!» «Тот, кто произнесет эти слова днём, будучи убеждённым в них, и умрёт в тот же день до наступления вечера, окажется среди обитателей Рая, а тот, кто произнесет их ночью, будучи убеждённым в том, что он говорит, и умрёт в ту же ночь до наступления утра, окажется из обитателей Рая». См. аль-Бухари (5947), ан-Насаи (5963)'),
  AboutZikrModel(
      description:
          '1. Читать (اية الكرسي ) аят «Аль-Курси». Польза этого: «Тот, кто прочитал этот аят утром, будет убережён от джина до вечера, а кто прочитал этот аят вечером, будет убережён от джина до утра». Хадис об этом передал ан-Насаи, шейх аль-Албани подтвердил достоверность. 2. Следует читать по три раза нижеследующие суры: «Искренность», «Рассвет», «Люди». Польза этого: «Кто сказал эти слова 3 раза утром и вечером, они уберегут его от любой вещи». Хадис об этом передали Абу Дауд и ат-Тирмизи.'),
  AboutZikrModel(
      description:
          'Zikr is a 7-dayzikr app. It will help you to manage your daily tasbix. You can add, edit, delete and view your tasbix.'),
  AboutZikrModel(
      description:
          'В Исламе термин «салават» (араб. صَلَوَات) относится к произнесению благословений на Пророка Мухаммада (ﷺ — мир ему и благословение Аллаха). Это является одной из важных практик многих мусульман.'),
  AboutZikrModel(
      description:
          'Истигфар (араб. إستغفار — просить прощение) — мольба ко Всевышнему о прощении грехов. Слово «истигфар» может также иметь значение «покорность» и «покаяние». Самой лучшей формулой истигфара считается «астагфирул-лахал-лязи ля иляяхэ илля хувайль-хайуюль-кайюм ва атуубу иляйхи» («Прошу прощения у Бога, наряду с Которым нет другого божества. Он Живой и Сущий. Каюсь перед Ним»). Имеются также и другие формулы. Самая простая формула истигфара выражается словами «астагфирул-лах» («Прошу прощения у Бога»). В случае совершения какого-либо греха произносить истигфар обязательно (ваджиб). Однако, даже если никакого греха и не было совершено, верующему все равно желательно (сунна) произносить это. Ведь известно, что сам пророк Мухаммад, известный своей набожностью и отстраненностью от грехов, часто и помногу произносил истигфар. Просить прощения за безбожников и атеистов запрещено. ')
];
