Repository: Zarlyk97/Practical_projects
Catalog: tasbix/lib/l10n/intl_*.arb
Languages: ky

source: Hello
ky: Салам

source: goodbye
ky: Жакшы кал

source: Tasbih
ky: Тасбих

source: Save
ky: Сактоо

source: Restore
ky: Калыбына

source: Dark theme
ky: Кара тема

source: Settings
ky: Ырастоо

source: General dhikrs
ky: Баардык зикрлер

source: Evening dhikrs
ky: Кечки зикрлер

source: Morning dhikrs
ky: Таңкы зикрлер

source: Selected dhikrs
ky: Тандалган зикрлер

source: Salavat
ky: Салават

source: Istighfar
ky: Истигфар

source: Language
ky: Тил
